<a href="https://colab.research.google.com/github/Babatunde-source/Data-science-batch-A/blob/main/data_cleansed.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [42]:
import numpy as np
import pandas as pd

In [43]:
df1= pd.read_csv("/content/results.csv")
df1

             date            home_team  ...        country  neutral
0      1872-11-30             Scotland  ...       Scotland    False
1      1873-03-08              England  ...        England    False
2      1874-03-07             Scotland  ...       Scotland    False
3      1875-03-06              England  ...        England    False
4      1876-03-04             Scotland  ...       Scotland    False
...           ...                  ...  ...            ...      ...
42423  2021-07-06  Trinidad and Tobago  ...  United States     True
42424  2021-07-07              England  ...        England    False
42425  2021-07-09                 Peru  ...         Brazil     True
42426  2021-07-10               Brazil  ...         Brazil    False
42427  2021-07-11              England  ...        England    False

[42428 rows x 9 columns]

In [44]:
# to print the first five rows
df1.head()

         date home_team away_team  ...     city   country neutral
0  1872-11-30  Scotland   England  ...  Glasgow  Scotland   False
1  1873-03-08   England  Scotland  ...   London   England   False
2  1874-03-07  Scotland   England  ...  Glasgow  Scotland   False
3  1875-03-06   England  Scotland  ...   London   England   False
4  1876-03-04  Scotland   England  ...  Glasgow  Scotland   False

[5 rows x 9 columns]

In [45]:
# to list columns
df1.columns

Index(['date', 'home_team', 'away_team', 'home_score', 'away_score',
       'tournament', 'city', 'country', 'neutral'],
      dtype='object')

In [46]:
# randomly select five rows
df1.sample(5)

             date home_team away_team  ...       city  country neutral
761    1923-11-01   Belgium   England  ...    Antwerp  Belgium   False
9672   1976-03-31    Kuwait      Oman  ...       Doha    Qatar    True
33680  2011-11-11   Georgia   Moldova  ...    Tbilisi  Georgia   False
23910  2001-05-04      Oman      Laos  ...     Muscat     Oman   False
32867  2011-02-09   Morocco     Niger  ...  Marrakech  Morocco   False

[5 rows x 9 columns]

In [47]:
# to check for missing value in boolean
df1.isnull()

        date  home_team  away_team  ...   city  country  neutral
0      False      False      False  ...  False    False    False
1      False      False      False  ...  False    False    False
2      False      False      False  ...  False    False    False
3      False      False      False  ...  False    False    False
4      False      False      False  ...  False    False    False
...      ...        ...        ...  ...    ...      ...      ...
42423  False      False      False  ...  False    False    False
42424  False      False      False  ...  False    False    False
42425  False      False      False  ...  False    False    False
42426  False      False      False  ...  False    False    False
42427  False      False      False  ...  False    False    False

[42428 rows x 9 columns]

In [48]:
# columns with NAN
df1.isnull().sum()

date          0
home_team     0
away_team     0
home_score    0
away_score    0
tournament    0
city          0
country       0
neutral       0
dtype: int64

In [49]:
# columns with NAN in boolean
df1.isnull().any()

date          False
home_team     False
away_team     False
home_score    False
away_score    False
tournament    False
city          False
country       False
neutral       False
dtype: bool

In [50]:
df1.isnull().any().any()

False

In [51]:
# to know the number of rows and columns respectively
df1.shape

(42428, 9)

In [65]:
df1.to_excel(r'data cleansed 1.xlsx', index= False)

In [52]:
df

           date            home_team         away_team               winner
0    1967-08-22                India            Taiwan               Taiwan
1    1971-11-14          South Korea  Vietnam Republic          South Korea
2    1972-05-17             Thailand       South Korea          South Korea
3    1972-05-19             Thailand          Cambodia             Thailand
4    1973-07-26             Malaysia            Kuwait             Malaysia
..          ...                  ...               ...                  ...
424  2021-07-06                Italy             Spain                Italy
425  2021-07-06  Trinidad and Tobago     French Guiana  Trinidad and Tobago
426  2021-07-06            Argentina          Colombia            Argentina
427  2021-07-06            Guatemala        Guadeloupe           Guadeloupe
428  2021-07-11              England             Italy                Italy

[429 rows x 4 columns]

In [53]:
df= pd.read_csv("/content/shootouts.csv")
df

           date            home_team         away_team               winner
0    1967-08-22                India            Taiwan               Taiwan
1    1971-11-14          South Korea  Vietnam Republic          South Korea
2    1972-05-17             Thailand       South Korea          South Korea
3    1972-05-19             Thailand          Cambodia             Thailand
4    1973-07-26             Malaysia            Kuwait             Malaysia
..          ...                  ...               ...                  ...
424  2021-07-06                Italy             Spain                Italy
425  2021-07-06  Trinidad and Tobago     French Guiana  Trinidad and Tobago
426  2021-07-06            Argentina          Colombia            Argentina
427  2021-07-06            Guatemala        Guadeloupe           Guadeloupe
428  2021-07-11              England             Italy                Italy

[429 rows x 4 columns]

In [54]:
# to print the first five rows
df.head()

         date    home_team         away_team       winner
0  1967-08-22        India            Taiwan       Taiwan
1  1971-11-14  South Korea  Vietnam Republic  South Korea
2  1972-05-17     Thailand       South Korea  South Korea
3  1972-05-19     Thailand          Cambodia     Thailand
4  1973-07-26     Malaysia            Kuwait     Malaysia

In [55]:
# to print at random five rows
df.sample(5)

           date home_team away_team    winner
164  1996-06-26   England   Germany   Germany
41   1983-02-27      Mali    Guinea      Mali
231  2001-07-28   Uruguay  Honduras  Honduras
52   1984-03-28      Iraq     Qatar      Iraq
254  2002-09-07     Syria      Iran      Iran

In [56]:
# to print the columns
df.columns

Index(['date', 'home_team', 'away_team', 'winner'], dtype='object')

In [57]:
# to check for missing value
df.isnull()

      date  home_team  away_team  winner
0    False      False      False   False
1    False      False      False   False
2    False      False      False   False
3    False      False      False   False
4    False      False      False   False
..     ...        ...        ...     ...
424  False      False      False   False
425  False      False      False   False
426  False      False      False   False
427  False      False      False   False
428  False      False      False   False

[429 rows x 4 columns]

In [58]:
# columns with NAN
df.isnull().sum()

date         0
home_team    0
away_team    0
winner       0
dtype: int64

In [59]:
# columns with NAN in boolean
df.isnull().any()

date         False
home_team    False
away_team    False
winner       False
dtype: bool

In [60]:
df.isnull().any().any()

False

In [61]:
# to know the number of rows and columns respectively
df.shape

(429, 4)

In [62]:
df.to_excel(r'data cleansed.xlsx',index= False)